DebtManagment/src/Documents/СменаСтатусаРаботыСДолгами/СменаСтатусаРаботыСДолгами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СменаСтатусаРаботыСДолгами</name>
  <registerRecords>InformationRegister.СтатусыРаботыСДолгом</registerRecords>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Реестр</name>
    <type>
      <types>DocumentRef.РеестрДолжников</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйСтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </attributes>
  <attributes>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Долги</name>
    <attributes>
      <name>Долг</name>
      <type>
        <types>CatalogRef.Долги</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйСтатусРаботыСДолгом</name>
      <type>
        <types>EnumRef.СтатусыРаботыСДолгом</types>
      </type>
    </attributes>
    <attributes>
      <name>Реестр</name>
      <type>
        <types>DocumentRef.РеестрДолжников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

DebtManagment/src/InformationRegisters/СтатусыРаботыСДолгом/СтатусыРаботыСДолгом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыРаботыСДолгом</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтатусРаботыСДолгом</name>
    <type>
      <types>EnumRef.СтатусыРаботыСДолгом</types>
    </type>
  </resources>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реестр</name>
    <type>
      <types>DocumentRef.РеестрДолжников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DebtManagment/src/Documents/СменаСтатусаРаботыСДолгами/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр СтатусыРаботыСДолгом
	Движения.СтатусыРаботыСДолгом.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.СтатусыРаботыСДолгом.Добавить();
		Движение.Период = Дата;
		Движение.Долг = ТекСтрокаДолги.Долг;
		Движение.Реестр = ТекСтрокаДолги.Реестр;
		Движение.СтатусРаботыСДолгом = ТекСтрокаДолги.НовыйСтатусРаботыСДолгом;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Вставить содержимое обработчика.
	Если ОбменДанными.Загрузка Тогда
     Возврат;
КонецЕсли;   
	Если Не ЗначениеЗаполнено(Ссылка) тогда
		Ответственный=ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
КонецПроцедуры
